//TODO Проверить, чтобы функции, возвращающие индекс - возвращали только положительные значения! 

//TODO Отдельно - обработка ошибок! С кодами. Исключения - только в исключительных случаях, когда нет других вариантов. 

//TODO На всякий случай сделать деструктор Массива. 

//TODO Тест удаления. del()

//TODO Тест нескольких сегментов. 

//TODO чтение по индексу []

//TODO Функция прямой записи значения в массив. set() И по индексу. [] 

//TODO В принципе, для индексного типа можно просто заложить максимальный unsigned. 

//TODO А тип очереди - задавать вручную при вызове конструктора. 